import Image from 'next/image';
import Container from '../../Container';

function About() {
  return (
    <Container className="mt-8 p-4 [&>p]:mb-4">
      <Image src="/img/poh-about/t8.png" alt="傅氏缘起" width={456} height={86} />
      <h5>傅氏精神</h5>
      <p>
        忠，从中，从心；本义作“敬”解，见《说文》，古以不懈于心为敬；必尽心任事始能不懈于位；故忠从心。又以中有不偏不倚之意，忠为正直之德，故从中声。
        意即子能承其亲，并能顺其意。故其本意作「善事父母者」，此谓之孝。人之行孝，不能离开敬。孔子曰：「盖犬马皆能有义，不敬何以别乎？」孝养父母，没有一定的形式，但皆要出自敬爱之心。
      </p>
      <p>
        廉，为堂屋之侧边。堂边廉石多平整修洁，又棱角高耸峭利，故人有高行谓之廉。明智者必以清操为励，以不贪为宝，效仿圣贤虽贫不受贿金，虽汤不饮盗泉。公廉约己，以身作则，即可明达政事；以德民，廉洁为政，则可安民治国。
        节不仅表现在夫妇之间，形容妻子对丈夫忠贞渝，坚持礼节，更可以表现在个人与民族之间，个人维护民族尊严，捍卫国家荣誉。毫无疑问，傅氏家训中的节字主要是讲第二层意思。
      </p>
      <h5>傅氏始祖</h5>
      <p>
        傅氏的得姓始祖傅说，在中国历史上是脍炙人口的。他的事迹明载于历来的史籍。《书经说明篇》：“高宗梦得说，使百工营求诸野，得诸傅岩，作说命三篇。”《史记殷本记》：“殷高宗贤相，初隐于傅岩，傅岩有涧水环道。说故为胥靡，版筑以供食。高宗梦说，求得之，与语，果贤，乃作说命三篇，号曰傅说，举以为相，国大治。
        所谓“版筑”就是以两板相夹，把泥土放入其中的一种古老建筑方法，是傅说发明的。后来被引伸为营造的统称。在三千三百多年以前傅说便能够采用这个方法来治水，实在是非常了不起的，所以有许多傅姓人氏，会以《版筑傅氏》自称，以纪念伟大的工程师始祖傅说。
      </p>
      <p>
        《版筑傅氏》的宗亲组织，在全球尤其东南亚处处可见。在东南亚就有：新加坡傅氏公会、马来西亚傅氏公会。槟城傅氏宗祠、印尼东爪哇傅氏宗亲联谊会，菲律宾版筑傅赖同宗会，都是极具规模的社团组织。当年傅说隐居生活的地方傅岩，根据考证是在今中国山西平陆县的东方，也称为傅险，卅年前的这个地名为隐贤社。这个地方有一个叫“圣人窟”的地方，相传即为当年傅说版筑之处，显然天下的中国傅姓人氏，都可以把根源追溯到这里。
      </p>
      <p>
        以傅说为世界全球傅姓人氏的始祖，已经是不争的定论。不过以前的姓氏学者也有人把傅姓的始源追溯得更远，像《唐书》的“宰相世系表”便指出“出姬姓，黄帝裔孙大田，封于傅邑，因以为氏。”据这个说法，则傅姓与周文王的姬姓一支不但同源，而且发迹得更早，绝对是一个源流远、历史久的古老家族。
      </p>
      <Image
        src="/img/poh-about/quote1.jpg"
        alt="忠孝廉节"
        width={456}
        height={86}
        className="w-full"
      />
      <h5>傅氏始祖</h5>
      <p>
        傅氏的得姓始祖傅说，在中国历史上是脍炙人口的。他的事迹明载于历来的史籍。《书经说明篇》：“高宗梦得说，使百工营求诸野，得诸傅岩，作说命三篇。”《史记殷本记》：“殷高宗贤相，初隐于傅岩，傅岩有涧水环道。说故为胥靡，版筑以供食。高宗梦说，求得之，与语，果贤，乃作说命三篇，号曰傅说，举以为相，国大治。
        所谓“版筑”就是以两板相夹，把泥土放入其中的一种古老建筑方法，是傅说发明的。后来被引伸为营造的统称。在三千三百多年以前傅说便能够采用这个方法来治水，实在是非常了不起的，所以有许多傅姓人氏，会以《版筑傅氏》自称，以纪念伟大的工程师始祖傅说。
      </p>
      <p>
        《版筑傅氏》的宗亲组织，在全球尤其东南亚处处可见。在东南亚就有：新加坡傅氏公会、马来西亚傅氏公会。槟城傅氏宗祠、印尼东爪哇傅氏宗亲联谊会，菲律宾版筑傅赖同宗会，都是极具规模的社团组织。当年傅说隐居生活的地方傅岩，根据考证是在今中国山西平陆县的东方，也称为傅险，卅年前的这个地名为隐贤社。这个地方有一个叫“圣人窟”的地方，相传即为当年傅说版筑之处，显然天下的中国傅姓人氏，都可以把根源追溯到这里。
      </p>
      <p>
        以傅说为世界全球傅姓人氏的始祖，已经是不争的定论。不过以前的姓氏学者也有人把傅姓的始源追溯得更远，像《唐书》的“宰相世系表”便指出“出姬姓，黄帝裔孙大田，封于傅邑，因以为氏。”据这个说法，则傅姓与周文王的姬姓一支不但同源，而且发迹得更早，绝对是一个源流远、历史久的古老家族。
      </p>
      <div className="mb-4 flex gap-8">
        <div>
          <Image src="/img/poh-about/origins1.jpg" alt="傅氏始祖 - 说公" width={800} height={905} />
        </div>
        <div>
          <Image src="/img/poh-about/origins2.jpg" alt="银青公 - 傅实" width={800} height={905} />
        </div>
      </div>
      <h5>历史传奇人物—傅说 奴隶 宰相 傅圣</h5>
      <p>
        傅氏祖先傅说，是历史真实人物，却有非常传奇的一生--从低层奴隶到一人之下，万人之上的宰相。历史尊为圣人，史称傅圣。
        傅说的“说”音与悦同，汉语拼音yue下声。
      </p>
      <p>
        傳说是三千多年前的商朝人士，他的一生与商朝贤君武丁王，有不可分割的关系。话说商朝国王盘庚自迁都后，商朝的国力再度恢复强大。盘庚在位廿八，去世时传位给其弟小辛。但小辛平庸无能，没有哥哥的治国才千，小辛不但没有才干也短命在位只三年，但在他统治期间，商朝义出现衰败的气象。
        小辛的王位由弟弟小乙继承。他觉察到国家缺乏人材，而且国力正在走下坡，他虽有心振兴国家，但自忖不是成汤，更没有兄长盘庚的才干。小乙虽然没有对商朝的国力做出甚么贡献，但是他对继承人却做出非常明智的决定，让商朝目后再次兴旺。
      </p>
      <p>
        按照商朝的宫廷规矩，小乙去世后，王位应该传回给长兄盘庚的儿子，但是小乙发现自己的儿子武丁才干杰出精明过人，是治国的君主人才，小乙明白能干的君主对国家的重要性，他毅然打破祖传的律条，立自己的儿子武丁为太子，未来的王位继承人。这自然会引起保守派的不满。小乙对武丁有很大的期望，他要栽培武丁日后成为贤明的国王，不让武丁留在王宫里享福，要他到民间接触社会生活，于是武丁隐瞒自己是太子的身份，在民间到处巡游，参与劳动了解民间疾苦。他也到处寻访许多有才学有见识，却被埋没有人间不为人知的人才，最著名的一位就是日后名震天下，流传历史的“奴隶宰相”傅说。傅说在身为奴隶时没有姓，他的名字叫“说”。他的祖先原本是自由的平民，还当过小官，但得罪了权贵被陷害，全家沦为奴隶，当时博说年龄还很小，一样面对奴隶的不幸命运。长大后使成为苦力。商代时气候温暖，雨水多，水涝成灾，从海边通往中原的盐运道时常被洪水冲断，国家就从四面八方征召奴隶来这里筑路防洪，确保盐道通畅无阻。傅说就是其中一名被征用当苦力的奴隶。虽然傅说从小就是奴隶，但是他天资聪颖，胆识过人，在筑路时常想到别人想不到的方法干活，省时省力且成效特好。在奴隶圈子中小有名气。在修筑河堤时泥土时常被洪水冲走白干一场，尤其是在下雨成灾时候，傅说发明了一种特别有效的方法“版筑”技术。这是一种用木板与泥筑墙的方法。这一发明彻底改变了奴隶们的劳动状态，提高了功效令他们不像以往那样辛苦又白费功夫，一时间轰动天下，朝野皆知傅说此人。傅说因此被人们另眼相看。
      </p>
      <p>
        傅说这时没有想到，他发明的版筑技术带给他的好处并不仅如此，更是他一生命运的转折点。一天，他在工地结识了一位特地前来探访他的青年，就是布衣出游的武丁。武丁也是在访寻贤明人才的途中，偶然间从奴隶的谈话中得知傅说此人。武丁好奇特来探访，两人惺惺相惜一见如故，很快成为好朋友。在来往的期间，武丁发现傅说虽然做的是下贱的奴隶工作，但是他为人一点也不粗俗，时常给其他奴隶讲故事，分析统治者的是非得失，评论国家政策，傅说分析得头头是道，有极精辟的见解。
        武丁又喜又忧，喜的是自己找到一位将来可以协助自己治国的人才，忧的是商朝戒律严格，尤重视社会地位，奴隶、百姓不能为官。傅说是奴隶，身份微贱，怎么能入朝当官呢。但是放弃了这样一位人才未免太可惜了，而且是国家的損失。武丁与傅说分手时，暗中决定将来自己当基为商朝国王时，一定要想出个好办法重用傅说。武丁不久继位为王，他曾经有三年不说话的神秘举止。在这守孝的三年里，武丁静心思索治国安天下的政策，同时也在思考如何提拔傅说，把他延入朝廷麦挥他的治国天才。武丁是一位贤明的国王，他觉得不重用傅说是非常可惜的，破格重用有才能的平民，还可以说得过去，反对声浪不会太大，但是奴隶的身份比平民更低贱，如果委以重任不但会给人耻笑，武丁还担心朝延中的反对派会借此挑衅生事，因为武丁继位不名正言顺，根基不稳，王位原本应该是他大伯盘庚的儿子继承，只是父亲小乙把王位给了自己，朝廷里的守旧派并不心服，武丁如果起用奴隶傅说，恐怕会被反对派乘机推翻自己。武丁三年不说话，也是利用这种神程举止转移朝廷大臣的注意力，大家都在著急新国王为甚么突然不说话，商朝的人特别迷信，还猜疑与鬼神有关。武丁是个聪明人，在这守丧的三年里他绞尽脑汁，想出了让傅说入朝廷的方法，他把第一句话留给重用傅说。
      </p>
      <p>
        三年守孝期满，武丁正式临朝，三年不说话的他第一句话就是对大臣宣布：“昨晚我梦到先祖汤了，他告诉我，他会賜给我一个辅助我治国的贤人，梦里他把这位贤人带到我面前，要我记往他的面貌，在人间寻访出来再重用他。”武丁假意说：“也许这位贾人是在你们朝廷大臣当中，让我好好看看是否在其中。”当然武丁没有朝廷大臣中找到贤人，他就说：“看来这位贤人不在朝廷里，也许在民间，你们就派人把他寻访出来吧。”于是召来画师，要他们把自己梦中的贤人面貌描绘出来，当然武丁说的贤人的容貌正是傅说。国君三年不说话，一开口就是传达商朝最贤明的已故国王成汤的意旨，大臣又惊又喜，急忙照办，派人在全国四处寻访贤人。傅说的画像在全国张贴，武丁王特意制造声势，傅说还没有被找到在人们的心中他已经是天賜给商朝的大贤人了。先是在平民找不到大贤，不久它员就在奴隶群里发现了傅说。虽然傅说这时蓬头垢发，衣衫褴褛，但是他的面貌却与画像中一模一样，国王梦到的大跹人竟然真的在国内找到了，官员喜不自胜，赶快把俜说从工地带走，为他沐浴换上整洁的新衣服，即刻把他送往朝廷。
        武丁王听到找到傅说了，高兴得立即从王宫跑出来迎接他，他见到来人果然就是他在民间认识的傳说。傅说呆住，他没想到那个与他惺惺相惜的青年原来是尊贵的国王，聪明过人的傅说也立即猜出一切都是武丁王的计划，目的只是要破格提拔自己这位奴入趄当官。他更感激武丁王了。武丁不想再浪费时间，立即委任傅说为宰相，賜给他可以还时向自己进谏的权力。傅说这时没有姓氏，只是名说。武丁要賜他姓氏，问他原来住在何处，傅说回答：“住的地方叫傅岩。”武丁王就说：“我封賜你姓傅吧，从此你就是傅说。”（“傅岩”位在今日中国山西平陆县。）傅说当了宰相后，果真显露出卓越的治国才干，他向武丁王呈上振兴商朝的策略《傅说三篇》，是震烁古今的政治军事学说。傅说建议政治上委人要唯贤不分贵贱，把几位当时的贤人都委以重任。军事上要强化武功训练，军事装备要强大，征服边疆四方国家开拓国家的领域，加强周边防卫，巩固王朝国土。经济上促进生产，鼓励商业贸易，增加国家收入，但要减轻人民税务，同时要减少向人民征兵服役，才有充足的人力生产。史书记载，傅相当宰相时，为了适应社会发展的需求。还对社会劳动者进行分化因材别类，劳动体力或者脑力，让脑力劳动者专门从事工艺制造，研究文化创造。据史书记载，傳说带领了脑力劳动者创造了中华文化历史上现存最早期的文字甲骨文。傅说当商朝的宰相时，商国的工匠在冶炼技术有了新的提高，冶炼方法有最新的改进，能在传统冶铜技术的基础上加进锡等矿物质，冶炼出青铜器。闻名千古的“司母成大方鼎”就是博说当宰相时铸造出来的，它是华夏文化的重要象征，也是傅说智慧的象征。青铜器出现，彻底摆脱了石器朝代。生产工具获得改进，也同时推进了生产力的发展，推动社会文明的大进步。傅说公当了商朝宰相五十余年，他的发明，他的智慧，他献给武丁王的治国要略，使商王朝疆域扩大许多，南到长江流域，北到燕山，西到陕西。东达海滨，成为当时最大的国家。商王武丁起用傅说，虽然利用殷人的迷信心理，但在当时的朝廷保守制度限制下，能够重用傅说这样低层出身的人，已经是了不起的事，也可看出武丁具备与众不同的眼光观察力，知人善任。正是这种君主英明，朝臣贤德的条件下，武丁与傅说君臣相知相重，历史上有名的商朝“武丁中兴”的盛世，终于出现了。
      </p>
    </Container>
  );
}

export default About;
